#+TITLE: Random Variables and Measures in Aesara
#+AUTHOR: Rémi Louf and Brandon T. Willard
#+DATE: 2022-11-30
#+EMAIL: aesara.devs@gmail.com

#+STARTUP: hideblocks indent hidestars
#+OPTIONS: ^:nil toc:nil tex:t d:results
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport

#+PROPERTY: header-args :eval never-export :exports both :results output drawer replace
#+PROPERTY: header-args+ :session
#+PROPERTY: header-args:latex :results raw replace :exports results :eval yes

#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../extra/custom.css" />

#+INCLUDE: latex-setup.org
#+BEGIN_SRC elisp :eval t :exports none :results none
;; If you want to load content from another org file...
(org-babel-lob-ingest "org-babel-extensions.org")
#+END_SRC

#+BEGIN_abstract
In this document we lay out the theoretical foundations for the representation and manipulation of random variables and probabilistic measures across the Aesara projects. The goal is to provide the language and the tools necessary to build flexible and non-ambiguous representations of probabilistic models.
#+END_abstract

* Random Variables
:PROPERTIES:
:CUSTOM_ID: sec:random-variables
:END:

Random variables are represented in Aesara with the =RandomVariable= operator, which corresponds to the following mathematical function:

$$
\operatorname{RandomVariable}: \Omega \times \Theta \to E
$$

Where $\Omega$ is the set of available seeds for the pseudo-random number generator, $\Theta$ the parameter space and $E$ the state space, in which the random variable takes its values. Aesara defines several random variable that are implicitly associated with probability measures of known density, association that is made explicit in AePPL. An Aesara graph that contains =RandomVariable= operators return samples from the associated distribution, i.e. elements of $E$ weighed by the density:

#+begin_src python
import aesara.tensor as at

srng = at.random.RandomStream(0)
x_rv = srng.normal(0, 1)
print(x_rv.eval())
#+end_src

#+RESULTS:
:results:
1.4436909546981256
:end:

The parameters of =RandomVariable=\s and the state space $E$ can be of different types; the mean $\mu$ and $\sigma$ parameters of =NormalRV= are scalars $\in \mathbb{R}$ but, for instance, =DirichletRV= takes a vector $\alpha \in \mathbb{R}^k$ as a parameter and returns a vector $\in \mathbb{R}^k$:

#+begin_src python
import aesara.tensor as at

srng = at.random.RandomStream(0)
alpha = at.as_tensor([1., 1., 1.])
x_rv = srng.dirichlet(alpha)
print(x_rv.eval())
#+end_src

#+RESULTS:
:results:
[0.62036389 0.14374215 0.23589397]
:end:

To create independent random variables, the =RandomVariable= operators apply the broadcasting rules between the parameters; Identically indepedently distributed random variables can be represented by a =RandomVariable= operator where the parameter =size= is used.


=RandomVariable= operators behave like generalized universal functions; they possess a set of core dimensionalities and can be vectorized over arrays of parameters, or repeated. This behavior is summarized in a gufunc-like signature =(), () -> ()= signature.

